<a href="https://colab.research.google.com/github/Zakharov1977/MIPT_ML/blob/main/%D0%90%D0%BD%D0%B0%D0%BB%D0%B8%D1%82%D0%B8%D0%BA%D0%B0_%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85_HW__%D0%97%D0%B0%D1%85%D0%B0%D1%80%D0%BE%D0%B2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**ДОМАШНЕЕ ЗАДАНИЕ 1**
 

**ДЕДЛАЙН ВЫПОЛНЕНИЯ: 11.12**

ЗАДАЧИ:
Используя SQL и пакет sqlite3 выполните следующие задания. Для первых 7 пунктов используйте полученные данные, для остальных заданий вам необходимо создать вашу собственную таблицу. (Все ответы принимаются только с выведением ID каждого из клиентов, подходящих под условия задачи. В задачах со средним выводить ID не нужно)

В ячейке с кодом написать решение в виде кода на языке Python и SQL. Ограничения в использовании библиотек/функций: Только pandasql и sqlite3. pandas только для считывания данных.

Правильность решения (за каждую задачу - 1 балл). Необходимо проверить, что SQL запрос оформлен верно, выдача соответствует условию задачи. Любая ошибка == 0 баллов за задачу. Любой провал assert (если он есть) == 0 баллов за задачу. Измененная задача/текст или условия задачи/assert == -1 балл за задачу.

ВАМ НЕОБХОДИМО:
В ячейке с кодом написать решение в виде кода на языке Python и SQL. Ограничения в использовании библиотек/функций: Только pandasql и sqlite3. pandas только для считывания данных.

**1. Опишите имеющиеся колонки в данных - сделайте аналог describe в pandas для колонок.**

In [ ]:
# All data was upload on google disc 
# (folder: https://drive.google.com/drive/u/0/folders/1UF6opSKQG3Ll2q7pEbwiiMFzX-XXdXAL
# подключаем доступ к локальному диску
from google.colab import drive 
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
!pip install pandasql

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: pandasql in /usr/local/lib/python3.8/dist-packages (0.7.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.8/dist-packages (from pandasql) (1.4.44)
Requirement already satisfied: pandas in /usr/local/lib/python3.8/dist-packages (from pandasql) (1.3.5)
Requirement already satisfied: numpy in /usr/local/lib/python3.8/dist-packages (from pandasql) (1.21.6)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.8/dist-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.8/dist-packages (from pandas->pandasql) (2022.6)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.8/dist-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.8/dist-packages (from sqlalchemy->pandasql) (2.0.1)

In [ ]:
# Устанавливаем нужные библиотеки
import pandas as pd
import numpy as np
import sqlite3
import pandasql

In [ ]:
# открываем данные с локального диска
DataSet_one = pd.read_excel('/content/drive/My Drive/HW/bank_account_data.xlsx')
df = DataSet_one.copy()
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Cust_ID     200 non-null    int64
 1   Purchase    200 non-null    int64
 2   Cheq_Bal    200 non-null    float64
 3   Sav_Bal     200 non-null    float64
 4   Debt_Bal    200 non-null    float64
 5   Joint_Acct  200 non-null    int64
 6   Age         200 non-null    int64
 7   Date        39 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(3), int64(4)
memory usage: 12.6 KB

   Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age       Date
0        1         0   1739.48  26918.18  12563.93           0   49        NaT
1        2         0   2862.35  23093.67  15457.88           0   39        NaT
2        3         0   2296.66  18037.33  12721.89           0   52        NaT
3        4         1   2880.28  32317.63   7075.03           0   28 2017-04-30
4        5         0    998.27  15110.04  11356.13           0   43        NaT

In [ ]:
df.describe(percentiles= None, include= None, exclude=None) # describle dataframe in pandas

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,100.500000,0.195000,2145.093500,22084.428950,8638.369600,0.295000,38.535000
std,57.879185,0.397195,652.712779,6048.106705,5280.852405,0.457187,11.336284
min,1.000000,0.000000,644.310000,6558.910000,0.000000,0.000000,18.000000
25%,50.750000,0.000000,1720.077500,18079.045000,4608.445000,0.000000,31.000000
50%,100.500000,0.000000,2108.125000,21374.210000,8272.175000,0.000000,37.000000
75%,150.250000,0.000000,2522.927500,25722.047500,12725.722500,1.000000,47.000000
max,200.000000,1.000000,4437.440000,39132.630000,20559.700000,1.000000,60.000000

In [ ]:
bank_accaunt = sqlite3.connect('/content/drive/My Drive/HW/bank_account_data.xlsx')

In [ ]:
bank_accaunt = pd.read_excel('/content/drive/My Drive/HW/bank_account_data.xlsx')

In [ ]:
bank_db = pandasql.sqldf("DESCRIBE bank_accaunt;") # ОПИСАНИЕ В SQL
print(bank_db)

**2. Посчитайте совокупный объем средств у клиентов в банке - сумма по всем балансам.**

In [ ]:
# сумма по отдельным счетам
bank_db = pandasql.sqldf('''SELECT SUM(Cheq_Bal), SUM(Sav_Bal),
SUM(Debt_Bal) FROM bank_accaunt;''')
print(bank_db)

   SUM(Cheq_Bal)  SUM(Sav_Bal)  SUM(Debt_Bal)
0       429018.7    4416885.79     1727673.92

In [ ]:
# сумма по всем счетам
bank_db = pandasql.sqldf('''SELECT SUM(Cheq_Bal) + SUM(Sav_Bal) + SUM(Debt_Bal) 
FROM bank_accaunt;''') 
print(bank_db)

   SUM(Cheq_Bal) + SUM(Sav_Bal) + SUM(Debt_Bal)
0                                    6573578.41

**3. Выведите только тех клиентов, которые приобрели ипотеку (колонка mortgage).**

In [ ]:
# Приобретение ипотеки очевидно отражено в колонке Purchase (т.к. колонки mortage нет,
# а есть название таблицы данных)
bank_db = pandasql.sqldf("SELECT * FROM bank_accaunt WHERE Purchase = 1;")
print(bank_db)

    Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age  \
0         4         1   2880.28  32317.63   7075.03           0   28
1         6         1   1936.83  34793.91   5107.54           1   18
2         7         1   3120.64  26794.63      0.00           0   18
3        11         1   3102.62  30968.27   4061.99           1   30
4        13         1   3130.37  25835.62      0.00           1   18
5        17         1   3039.48  30613.79   5554.76           0   18
6        18         1   2494.98  24373.14   9698.50           1   18
7        20         1   2298.07  26145.04   1501.87           0   21
8        22         1   2549.88  34471.03   6742.45           0   21
9        31         1   2665.14  20165.00      0.00           1   18
10       36         1   2319.18  25954.64   6815.54           1   39
11       38         1   4299.16  20375.43      0.00           0   25
12       40         1   2513.96  26745.83  14411.41           0   18
13       41         1   3615.80  24983.76   5663.16           0   45
14       54         1   2754.18  33349.32   7459.32           1   18
15       56         1   2790.23  31067.08   5092.66           0   39
16       59         1   3220.97  36129.45      0.00           1   32
17       60         1   2701.66  29715.61      0.00           0   37
18       74         1   1947.82  30773.03   3030.66           0   18
19       76         1   3607.71  28075.38   5003.81           1   31
20       80         1   1777.86  31724.27   6246.78           1   40
21       87         1   2843.90  33648.94      0.00           0   33
22       91         1   3106.03  27822.58   5006.80           0   22
23       93         1   2797.89  37555.34   1943.04           1   43
24       94         1   2243.11  30612.97   3342.03           0   44
25       97         1   2407.89  33979.81      0.00           0   44
26      100         1   2711.18  25006.94      0.00           0   18
27      107         1   1972.26  25263.32   2046.91           1   34
28      111         1   2923.71  36412.42      0.00           1   39
29      113         1   3457.57  28487.17      0.00           0   18
30      132         1   2604.41  39132.63  14560.47           1   18
31      146         1   2150.40  31448.05   4611.83           1   24
32      154         1   4437.44  30606.51   1619.60           1   18
33      166         1   3352.54  28346.26   2751.76           1   43
34      169         1   2886.44  20443.86   5614.26           1   35
35      182         1   2239.27  35595.95   1370.95           1   23
36      184         1   2054.06  25825.63   3486.34           1   44
37      185         1   1759.04  29198.17   3285.39           1   36
38      189         1   2847.09  30716.60      0.00           1   18

                          Date
0   2017-04-30 00:00:00.000000
1   2017-05-30 00:00:00.000000
2   2017-08-13 00:00:00.000000
3   2017-05-16 00:00:00.000000
4   2017-07-07 00:00:00.000000
5   2017-06-29 00:00:00.000000
6   2017-08-29 00:00:00.000000
7   2017-07-22 00:00:00.000000
8   2017-04-04 00:00:00.000000
9   2017-05-30 00:00:00.000000
10  2017-04-22 00:00:00.000000
11  2017-08-09 00:00:00.000000
12  2017-07-11 00:00:00.000000
13  2017-08-25 00:00:00.000000
14  2017-04-15 00:00:00.000000
15  2017-05-29 00:00:00.000000
16  2017-05-19 00:00:00.000000
17  2017-04-19 00:00:00.000000
18  2017-07-29 00:00:00.000000
19  2017-04-23 00:00:00.000000
20  2017-07-09 00:00:00.000000
21  2017-04-25 00:00:00.000000
22  2017-07-05 00:00:00.000000
23  2017-04-12 00:00:00.000000
24  2017-08-17 00:00:00.000000
25  2017-07-13 00:00:00.000000
26  2017-07-02 00:00:00.000000
27  2017-08-15 00:00:00.000000
28  2017-06-19 00:00:00.000000
29  2017-06-08 00:00:00.000000
30  2017-08-01 00:00:00.000000
31  2017-07-02 00:00:00.000000
32  2017-08-14 00:00:00.000000
33  2017-05-28 00:00:00.000000
34  2017-06-19 00:00:00.000000
35  2017-05-03 00:00:00.000000
36  2017-06-15 00:00:00.000000
37  2017-04-01 00:00:00.000000
38  2017-07-03 00:00:00.000000

**4. Какой совокупный объем средств в среднем у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?**

In [ ]:
# Объем соредств у клиентов банка, которые приобрели иботеку по всем балансам
bank_db = pandasql.sqldf('''SELECT SUM(Cheq_Bal) + SUM(Sav_Bal) + SUM(Debt_Bal)
FROM bank_accaunt WHERE Purchase = 1;''') 
print(bank_db)

   SUM(Cheq_Bal) + SUM(Sav_Bal) + SUM(Debt_Bal)
0                                    1406140.92

In [ ]:
# Объем соредств у клиентов банка, которые приобрели иботеку по отдельным балансам
bank_db = pandasql.sqldf('''SELECT SUM(Cheq_Bal), SUM(Sav_Bal), 
SUM(Debt_Bal) FROM bank_accaunt WHERE Purchase = 1;''') 
print(bank_db)

   SUM(Cheq_Bal)  SUM(Sav_Bal)  SUM(Debt_Bal)
0      107561.05    1155475.01      143104.86

In [ ]:
# Объем соредств у клиентов банка, которые НЕ приобрели иботеку по всем балансам
bank_db = pandasql.sqldf('''SELECT SUM(Cheq_Bal) + SUM(Sav_Bal) + SUM(Debt_Bal)
FROM bank_accaunt WHERE Purchase = 0;''') 
print(bank_db)

   SUM(Cheq_Bal) + SUM(Sav_Bal) + SUM(Debt_Bal)
0                                    5167437.49

In [ ]:
# Объем соредств у клиентов банка, которые НЕ приобрели иботеку по отдельным балансам
bank_db = pandasql.sqldf('''SELECT SUM(Cheq_Bal), SUM(Sav_Bal), SUM(Debt_Bal) 
FROM bank_accaunt WHERE Purchase = 0;''') 
print(bank_db)

   SUM(Cheq_Bal)  SUM(Sav_Bal)  SUM(Debt_Bal)
0      321457.65    3261410.78     1584569.06

**5. Есть ли разница в среднем по каждому из типов баланса у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?**

In [ ]:
# Среднее по отдельным счетам у клиентов банка, которые НЕ приобрели иботеку
bank_db = pandasql.sqldf('''SELECT AVG(Cheq_Bal), AVG(Sav_Bal), AVG(Debt_Bal) 
FROM bank_accaunt WHERE Purchase = 0;''') 
print(bank_db)
# Среднее по отдельным счетам у клиентов банка, которые приобрели иботеку
bank_db = pandasql.sqldf('''SELECT AVG(Cheq_Bal), AVG(Sav_Bal),AVG(Debt_Bal) 
FROM bank_accaunt WHERE Purchase = 1;''') 
print(bank_db)
# Наглядно видно, что по  счету у Sav_Bal среднее значение больше у клиентов 
# банка, которые не брали ипотеку. По остальным счетам ситуация обратная

   AVG(Cheq_Bal)  AVG(Sav_Bal)  AVG(Debt_Bal)
0    1996.631366  20257.209814    9842.043851
   AVG(Cheq_Bal)  AVG(Sav_Bal)  AVG(Debt_Bal)
0    2757.975641  29627.564359    3669.355385

**6. Выберите самого возрастного получателя ипотеки.**

In [ ]:
bank_db = pandasql.sqldf("SELECT Cust_ID, AGE FROM bank_accaunt WHERE Purchase = 0 ;") 
print(bank_db)

     Cust_ID  Age
0          1   49
1          2   39
2          3   52
3          5   43
4          8   47
..       ...  ...
156      196   32
157      197   27
158      198   44
159      199   38
160      200   56

[161 rows x 2 columns]

**7. Выберите клиента, который раньше всех получил ипотеку.**

In [ ]:
bank_db = pandasql.sqldf('''SELECT Cust_ID, Age FROM bank_accaunt 
WHERE Purchase = 0 ORDER BY Age DESC LIMIT 1;''') 
print(bank_db)

   Cust_ID  Age
0       34   60

**8. Создайте любую базу данных в sqlite3, состоящую из 5 колонок, одна из колонок обязательно должна быть типа REAL. (Названия колонок любые, какие захотите)**

In [146]:
import sqlite3
conn = sqlite3.connect("test_basa.db")
cur = conn.cursor()
cur.execute ('''
CREATE TABLE patients 
(id INTEGER, 
name STRING, 
data_of_birth DATE, 
adress STRING, 
wight REAL);''')
res = cur.execute("SELECT name FROM sqlite_master")
res.fetchone()

('patients',)

**9. Добавьте 3 полностью заполненные строки в вашу БД.**

In [150]:
con = sqlite3.connect("test_basa.db")
cur = con.cursor()
cur.execute ('''INSERT INTO patients VALUES
  (1, 'Ivanov I.I.', 2020-01-01, 'Samara', 52),
  (2, 'Ivanov I.P.', 2020-02-01, 'Saratov', 84),
  (3, 'Sidorov G.M.', 2015-03-05, 'Moscow', 75)
  ;''')

**10. Удалите строку из колонки типа REAL (из пункта 8), в которой значение признака среднее (то есть не минимальное и не максимальное). Напрямую указывать значение из этой строки нельзя.**

In [ ]:
con = sqlite3.connect("test_basa.db")
cur = con.cursor()
cur.execute("DELETE FROM patients WHERE wight = AVG(wight);")

In [ ]:
# альтернативный вариант, если значение не равно минимуму и максимуму
con = sqlite3.connect("test_basa.db")
cur = con.cursor()
cur.execute("DELETE FROM patients WHERE wight != MIN(wight) ADN wight != MAX(wight);")